; domain
(define (domain seaport)
(:requirements :strips :typing)
(:types harbour harbour_asset - object
  dock wharf - harbour
        barge derrick deck - harbour_asset
        pontoon bale - deck)

(:predicates (moored_at ?x - harbour_asset ?y - harbour)
             (stowed_on ?x - bale ?y - deck)
             (loaded_in ?x - bale ?y - barge)
             (hoisting ?x - derrick ?y - bale)
             (ready ?x - derrick)
             (empty ?x - deck))

(:action sail
  :parameters (?x - barge ?y - harbour ?z - harbour)
  :precondition (and (moored_at ?x ?y))
  :effect (and (not (moored_at ?x ?y)) (moored_at ?x ?z)))

(:action hoist_up
  :parameters (?x - derrick ?y - bale ?z - deck ?p - harbour)
  :precondition (and (moored_at ?x ?p) (ready ?x) (moored_at ?y ?p) (stowed_on ?y ?z) (empty ?y))
  :effect (and (not (moored_at ?y ?p)) (hoisting ?x ?y) (not (empty ?y)) (not (ready ?x)) (empty ?z) (not (stowed_on ?y ?z))))

(:action lower_down
  :parameters (?x - derrick ?y - bale ?z - deck ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (empty ?z) (hoisting ?x ?y))
  :effect (and (ready ?x) (not (hoisting ?x ?y)) (moored_at ?y ?p) (not (empty ?z)) (empty ?y)(stowed_on ?y ?z)))

(:action stow
  :parameters (?x - derrick ?y - bale ?z - barge ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (hoisting ?x ?y))
  :effect (and (not (hoisting ?x ?y)) (loaded_in ?y ?z) (ready ?x)))

(:action unstow
  :parameters (?x - derrick ?y - bale ?z - barge ?p - harbour)
  :precondition (and (moored_at ?x ?p) (moored_at ?z ?p) (ready ?x) (loaded_in ?y ?z))
  :effect (and (not (loaded_in ?y ?z)) (not (ready ?x)) (hoisting ?x ?y)))

)

; problem
(define (problem depotprob134536825) (:domain seaport)
(:objects
	dock0 - dock
	wharf0 - wharf
	barge0 - barge
	pontoon0 pontoon1 - pontoon
	bale0 bale1 - bale
	derrick0 derrick1 - derrick)
(:init
	(moored_at pontoon0 dock0)
	(empty pontoon0)
	(moored_at pontoon1 wharf0)
	(empty bale1)
	(moored_at barge0 wharf0)
	(moored_at derrick0 dock0)
	(ready derrick0)
	(moored_at derrick1 wharf0)
	(ready derrick1)
	(moored_at bale0 wharf0)
	(stowed_on bale0 pontoon1)
	(moored_at bale1 wharf0)
	(stowed_on bale1 bale0)
)

(:goal (and
		(stowed_on bale0 pontoon0)
		(stowed_on bale1 bale0)
	)
))

; plan
1. (hoist_up derrick1 bale1 bale0 wharf0)
   deleted: (moored_at bale1 wharf0) (empty bale1) (ready derrick1) (stowed_on bale1 bale0)
   added: (hoisting derrick1 bale1) (empty bale0)
   goals met: 0 of 2
2. (stow derrick1 bale1 barge0 wharf0)
   deleted: (hoisting derrick1 bale1)
   added: (loaded_in bale1 barge0) (ready derrick1)
   goals met: 0 of 2
3. (hoist_up derrick1 bale0 pontoon1 wharf0)
   deleted: (moored_at bale0 wharf0) (empty bale0) (ready derrick1) (stowed_on bale0 pontoon1)
   added: (hoisting derrick1 bale0) (empty pontoon1)
   goals met: 0 of 2
4. (stow derrick1 bale0 barge0 wharf0)
   deleted: (hoisting derrick1 bale0)
   added: (loaded_in bale0 barge0) (ready derrick1)
   goals met: 0 of 2
5. (sail barge0 wharf0 dock0)
   deleted: (moored_at barge0 wharf0)
   added: (moored_at barge0 dock0)
   goals met: 0 of 2
6. (unstow derrick0 bale0 barge0 dock0)
   deleted: (loaded_in bale0 barge0) (ready derrick0)
   added: (hoisting derrick0 bale0)
   goals met: 0 of 2
7. (lower_down derrick0 bale0 pontoon0 dock0)
   deleted: (hoisting derrick0 bale0) (empty pontoon0)
   added: (ready derrick0) (moored_at bale0 dock0) (empty bale0) (stowed_on bale0 pontoon0)
   goals met: 1 of 2
8. (unstow derrick0 bale1 barge0 dock0)
   deleted: (loaded_in bale1 barge0) (ready derrick0)
   added: (hoisting derrick0 bale1)
   goals met: 1 of 2
9. (lower_down derrick0 bale1 bale0 dock0)
   deleted: (hoisting derrick0 bale1) (empty bale0)
   added: (ready derrick0) (moored_at bale1 dock0) (empty bale1) (stowed_on bale1 bale0)
   goals met: 2 of 2
